<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" >
   <head>
       <title>8-Bit Robot Music Party</title>
       <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	   <meta name="Description" content="Jeu d&eacute;velopp&eacute; par SwitchCode m&ecric;lant plates-formes et rythme">
	   <meta name="Keywords" content="robot, music, 8-bits, party, switchcode, jeuxamateurs, jeu, amateur, indie, spintronic">
	   <link media="screen" title="design" href="data/design.css" type="text/css" rel="stylesheet">
   </head>
   <body>
       <div id="header">
           <h1><a href="#"><img src="data/logo.png" alt="8-Bit Robot Music Party"/></a></h1>
		   <hr/>
       </div>
	   
		<ul id="menu">
			<li><a href="index.html#presentation">Pr&eacute;sentation rapide</a></li>
			<li><a href="index.html#scenario">Le sc&eacute;nario</a></li>
			<li><a href="index.html#gameplay">Le gameplay</a></li>
			<li><a href="index.html#astuces">Comment profiter au mieux du jeu</a></li>
			<li><a href="index.html#telecharger">T&eacute;l&eacute;charger</a></li>
			<li><a href="index.html#equipe">L'&eacute;quipe</a></li>
		</ul>
	   
		<div id="corps">
			<hr/>
			<h3 id="presentation">Pr&eacute;sentation rapide</h3>
			<p>
				8-Bit Robot Music Party (abr&eacute;g&eacute; 8RMP) et un jeu de rythme/plate-forme concoct&eacute; sp&eacute;cialement par l'&eacute;quipe de d&eacute;veloppement
				SwitchCode &agrave; l'occasion du concours Innov'Game organis&eacute; par l'EFREI, (une &eacute;cole d'ing&eacute;nieur en informatique sur Paris).
				Nous avons d'abord d&ucirc; constituer un dossier qui nous a permi d'&ecirc;tre s&eacute;lectionn&eacute;s pour le deuxi&egrave;me round. La programmation du jeu a donc
				vraiment d&eacute;but&eacute; d&eacute;but janvier (d&egrave;s l'annonce des r&eacute;sultats du round 1), ce qui nous a laiss&eacute; pr&egrave;s de trois mois et
				demi pour concr&eacute;tiser notre projet. Malgr&eacute; ce laps de temps assez cons&eacute;quent, nous n'avons malheureusement pas pu int&eacute;grer au jeu toutes
				les fonctionnalit&eacute;s pr&eacute;vues, mais le principal est fait et disponible !
			</p>

			<h3 id="scenario">Le sc&eacute;nario</h3>
			<p>
				X, 32 ans, bidouilleur passionn&eacute; de jeux vid&eacute;o vient de mettre au point une machine permettant
				de m&eacute;langer deux univers vid&eacute;o-ludiques diff&eacute;rents. Afin de pouvoir enfin la tester, il invite
				deux amis d'enfance en leur demandant d'apporter leur jeu pr&eacute;f&eacute;r&eacute;. Ainsi, A, apporte Robot Party
				un jeu de plate-forme, et B, 8-Bit Music, un jeu de rythme.<br/>
				Alors que les trois comp&egrave;res s'appr&ecirc;tent &agrave; lancer la machine, une panne de courant survient et plonge la pi&egrave;ce dans
				le noir. Lorsque la lumi&egrave;re revient, A et B s'aper&ccedil;oivent que leur ami n'est plus l&agrave;. Ils remarquent alors que l'&eacute;cran reli&eacute; &agrave;
				la fameuse machine est allum&eacute; et entendent soudainement la voix de leur ami sortant de la t&eacute;l&eacute;vision. Les deux camarades
				se rendent alors compte de l'ampleur du probl&egrave;me : X est coinc&eacute; dans le jeu, et plus pr&eacute;cis&eacute;ment dans la peau du personnage
				principal. Comme il n'a aucun moyen d'action sur lui, A et B d&eacute;cident de lancer une partie dont l'enjeu est la survie
				de X !<br/>
				<strong>Vous &ecirc;tes A et B et pour sauver X, vous devrez jouer.<br/>
				Pour le sauver, vous devrez gagner.<br/>
				Terminez ensemble le niveau avant la fin de la musique, et faites de votre amiti&eacute; une force.<br/>
				Une fausse note, un faux pas et vous ne le reverrez jamais !<br/></strong>
			</p>

			<h3 id="gameplay">Le gameplay</h3>
			<p>
				Le jeu se d&eacute;compose donc en deux parties :
				<ul>
					<li><strong>8-Bit Music : </strong><br/>Les notes arrivent en rythme sur votre &eacute;cran. Lorsqu'elles atteignent la barre du bas, vous devez les frapper avec des touches diff&eacute;rentes suivant leurs
					positions. Si elles se trouvent sur la premi&egrave;re ligne, appuyez sur 1, et ainsi de suite jusqu'&agrave; 4.</li>
					<li><strong>Robot Party : </strong><br/>&Agrave; la mani&egrave;re d'un mario, vous devrez atteindre la fin du niveau en d&eacute;jouant les surprise que vous r&eacute;servent les d&eacute;veloppeurs (c'est nous gnihihi).
					Vous pouvez donc contr&ocirc;ler le personnage principal, rien qu'avec les touches directionnelles.</li>
				</ul>	
			</p>

			<h3 id="astuces">Comment profiter au mieux du jeu</h3>
			<p>
				<em>Dans le rush de fin, il nous est arriv&eacute; de faire quelques b&ecirc;tises. Afin de vous proposer une meilleure exp&eacute;
				rience du jeu ainsi que moins de bug, voici quelques d&eacute;tails &agrave; r&eacute;gler apr&egrave;s le t&eacute;l&eacute;chargement :</em>
			<ul>	
				<li>Niveau 2 : Dans le dossier du jeu, ouvrir "images/tilesets/tileset2.props". Effacer, puis changer le mot pr&eacute;c&eacute;d&eacute; du nombre "20" en "nocif".
				Changer de la m&ecirc;me mani&egrave;re la ligne "30" en "mur".</li>

				<li>Niveau 4 (&agrave; r&eacute;server aux pro game masters): Dans le m&ecirc;me dossier ("images/tilesets"), ouvrir le fichier "tileset4.props". Effacer, puis changer le mot pr&eacute;c&eacute;d&eacute; du nombre "20" en "nocifeph". 
				Astuce pour la fin : se coller &agrave; la paroi de droite sur le dernier saut.</li>

				<li>Niveau 6 : Si le niveau vous para&icirc;t au contraire tr&egrave;s hardcore, vous pouvez changer &agrave; votre guise la valeur des tiles de pics. Pour cela, ouvrir "images/tilesets/tileset6.props" et
				modifier les lignes "10 et "20" le "nocif" en "nocifeph" ou "vide".</li>
			</ul>
			<p>Petite pr&eacute;cision : le ichier peuvent &ecirc;tre ouverts avec l'outil Bloc Note de Windows ou n'importe quel &eacute;diteur de texte.</p>
			<p><em>Pour le reste, sachez qu'il existe d'autres bugs r&eacute;currents (autant que vous soyez pr&eacute;venus) :</em></p>
			<ul>
				<li>Au d&eacute;marrage, si le d&eacute;grad&eacute;s plantent, appuyer sur echap avant la fin de la troisi&egrave;me image pour arriver sur le menu.</li>
				<li>Si vous atterrissez sur une case qui s'&eacute;l&egrave;ve &agrave; un tile de hauteur, votre personnage meurt. Cela emp&ecirc;che de terminer certains 
				niveaux, mais si cela vous tente, vous pouvez prendre le fichier codant pour le tileset du niveau "level/niveauX.lvl", et rajouter une ligne de "0". </li>
				<li>Si vous scrollez tout &agrave; droite dans le dernier niveau, le jeu plantera, car nous n'avons tout simplement pas eu le temps de le coder.
				En attendant, la musique, elle est jouable ! Have fun !</li>
			</ul>	

			<h3 id="telecharger">T&eacute;l&eacute;charger</h3>
			<p><a href="#">Ici lien à télécharger avec votre script</a></p>

			<h3 id="equipe">L'&eacute;quipe</h3>
			<p>&Eacute;quipe SwitchCode compos&eacute;e de Alexis LAUNAY (1S) - 16 ans &amp; Kilian OLLIVIER (1S) - 16 ans</p>
       </div>
 
       <div id="footer">
			<hr/>
			<p>Le site et le jeu ont &eacute;t&eacute; d&eacute;velopp&eacute;s par SwitchCode dans le cadre du concours <a href="http://innovgame.efrei.fr/">"Innov'Game by EFREI 2011"</a></p>
			<p>Soutenu par <a href="http://spintronic.fr"><img src="data/spintronic.png" alt="Spintronic"/></a> et <a href="http://jeuxamateurs.fr"><img src="data/jeuxamateurs.png" alt="JeuxAmateurs.fr"/></a></p>
       </div>

   </body>
</html>
